<template>
  <div class="grid grid-cols-1 px-4 md:px-20">
    <div
      class="flex justify-center mb-10 bg-secondarybuu rounded-xl"
      v-for="item in boxAboutUs"
      :key="item.id"
    >
      <div class="rounded-l-xl text-center w-1/2">
        <img
          class="w-auto h-[543px] object-cover rounded-l-xl"
          :src="item.imgUrl"
          :alt="item.alt"
        />
      </div>
      <div class="rounded-r-xl text-center w-1/2">
        <div>
          <div class="my-16 mr-10 text-center text-white">
            <h2 class="text-3xl font-bold capitalize pb-5">{{ item.name }}</h2>
            <p class="text-lg text-start indent-10">{{ item.description }}</p>
          </div>
        </div>
      </div>
    </div>
  </div>
</template>

<script setup>
const boxAboutUs = [
  {
    id: 1,
    name: "เกี่ยวกับเรา",
    description:
      "ก้าวสำคัญของโลกอนาคตด้วยการขับเคลื่อนด้วยข้อมูล เป็นสิ่งสำคัญที่จะต้องมีการเตรียมความพร้อมของการจัดเก็บข้อมูลที่ถูกต้อง เข้าใจลักษณะพื้นฐานของข้อมูล มีกระบวนการจัดเก็บข้อมูลที่ถูกหลักการ เพื่อสามารถนำข้อมูลไปใช้ประโยชน์ได้จริง การสร้างระบบจัดเก็บข้อมูลให้มีคุณภาพ เข้าถึงง่าย จึงมีความจำเป็น ที่ทำให้ข้อมูลมีมาตรฐาน สามารถยกระดับมูลค่าของข้อมูลในรูปแบบงานวิจัยทางวิทยาศาสตร์ และสังคมศาสตร์ พร้อมด้วยการวิเคราะห์ข้อมูลเพื่อตอบโจทย์ความต้องการของผู้ใช้บริการทั้งเกษตรกร แรงงาน ภาคเอกชน และหน่วยงานรัฐบาล ดังนั้น ทีมงาน มหาวิทยาลัยบูรพา วิทยาเขตจันทบุรี และทีมงานคณาจารย์ คณะวิทยาศาสตร์และศิลปศาสตร์ จึงได้เริ่มการจัดเก็บบัญชีข้อมูลโดยเริ่มต้นความร่วมมือจากหน่วยงานภาครัฐในจังหวัดจันทบุรี เพื่อที่จะสร้างศูนย์ข้อมูลในภาคตะวันออก ที่คาดหวังว่าสามารถตอบโจทย์ความต้องการของประชาชนในจังหวัดด้วยมูลค่าของข้อมูล โดยเฉพาะอย่างยิ่งการช่วยเหลือกลุ่มเกษตรกรที่เป็นรากฐานสำคัญของประเทศไทย นอกจากนี้ทางทีมงานวางแผนที่จะพัฒนาระบบฐานข้อมูล ๆ การใช้เทคโนโลยีด้านข้อมูล และสร้าง website เพื่อเสนอข้อมูลด้วยภาพ รวมไปถึงระบบการพยากรณ์ต่าง ๆ ที่ประชาชนสามารถเข้าถึงข้อมูลพื้นฐานทางการเกษตร และเศรษฐกิจได้ โดยศูนย์ข้อมูลแห่งนี้เกิดจากการเริ่มต้นจากศูนย์ข้อมูลทางการเกษตรในจังหวัดจันทบุรี",
    href: "#",
    imgUrl: "/images/Contact_Us/IMG_3847.jpg",
    alt: "a.aun ผู้รับผิดชอบโครงการ",
  },
];
</script>
